Repository: 5axes/Cura-MeshTools
Catalog: resources/i18n/*/meshtools.po
Languages: it_it, nl_nl

# @item:inmenu
source: Reload model
it_it: Ricarica modello
nl_nl: Laad model opnieuw

# @item:inmenu
source: Rename model...
it_it: Rinomina modello...
nl_nl: Hernoem model...

# @item:inmenu
source: Replace models...
it_it: Sostituisci modelli...
nl_nl: Vervang modellen...

# @item:inmenu
source: Check models
it_it: Controlla modelli
nl_nl: Controlleer modellen

# @item:inmenu
source: Analyse models
it_it: Analizza modelli
nl_nl: Analyseer modellen

# @item:inmenu
source: Fix simple holes
it_it: Correggi buchi semplici
nl_nl: Repareer eenvoudige gaten

# @item:inmenu
source: Fix model normals
it_it: Correggi normali dei modelli
nl_nl: Repareer model normaal-vectoren

# @item:inmenu
source: Split model into parts
it_it: Dividi modello in parti
nl_nl: Breek model in delen

# @item:inmenu
source: Randomise location
it_it: Posizione casuale
nl_nl: Geef willekeurige locatie

# @item:inmenu
source: Apply transformations to mesh
it_it: Applica trasformazioni alla maglia
nl_nl: Pas transformatie toe op structuur

# @item:inmenu
source: Reset origin to center of mesh
it_it: Ripristina l'origine al centro della maglia
nl_nl: Verplaats de oorsprong van de structuur naar het midden

# @item:inmenu
source: Mesh Tools settings...
it_it: Impostazioni strumenti della maglia...
nl_nl: Mesh Tools instellingen...

# @info:title
source: Mesh Tools
it_it: Strumenti della maglia

# @text Print job name
source: Untitled
it_it: Senza titolo
nl_nl: Zonder titel

# @info:status
source: Model %s is not watertight, and may not print properly.
it_it: Il modello %s non è "waterthight" e potrebbe non essere stampato correttamente.
nl_nl: Model %s is niet waterdicht, and wordt wellicht niet juist geprint.

# @info:status
source: Check X-Ray View and repair the model before printing it.
it_it: Controlla la vista a raggi X e ripara il modello prima di stamparlo.
nl_nl: Bekijk de Röntgenweergave en repareer het model alvorens het te printen.

# @action:button
source: Show X-Ray View
it_it: Mostra la vista a raggi X
nl_nl: Toon Röntgenweergave

# @info:status
source: Repair the model before printing it.
it_it: Ripara il modello prima di stamparlo.
nl_nl: Repareer het model alvorens het te printen

# @info:status
source: Please select a single model first
it_it: Si prega di selezionare prima un singolo modello
nl_nl: Selecteer eerst één model

# @info:status
source: Please select one or more models first
it_it: Si prega di selezionare prima uno o più modelli
nl_nl: Selecteer eerst één of meer modellen

# @info:status
source: Check summary:
it_it: Controlla il riepilogo:
nl_nl: Controle samenvatting:

# @info:status
source: is watertight
it_it: è "waterthight"
nl_nl: is waterdicht

# @info:status
source: is not watertight and may not print properly
it_it: non è "waterthight" a non può essere stampato correttamente
nl_nl: is niet waterdicht en wordt wellicht niet juist afgedrukt

# @info:status
source: and consists of {body_count} submeshes
it_it: e consiste in {body_count} sottomaglie
nl_nl: en bestaat uit {body_count} onderdelen

# @info:status
source: Analysis summary:
it_it: Riepilogo dell'analisi:
nl_nl: Analyse samenvatting:

# @info:status
source: %d vertices, %d faces
it_it: %d vertici, %d facce

# @info:status
source: The mesh needs more extensive repair to become watertight
it_it: La maglia necessita di una riparazione più estensiva per diventare "watertight"
nl_nl: Het model heeft een meer diepgaande reparatie nodig om waterdicht te zijn.

# @info:status
source: Split result:
it_it: Risultato della divisione:
nl_nl: Resultaat van opdelen:

# @info:status
source: was split in %d submeshes
it_it: è stato diviso in %d sottomaglie
nl_nl: is opgedeeld in %d onderdelen

# @info:status
source: could not be split into submeshes
it_it: non può essere diviso in sottomaglie
nl_nl: kon niet worden opgedeeld in onderdelen

# @info:status
source: Replacing a group is not supported
it_it: La sostituzione del gruppo non è supportata
nl_nl: Een groep vervangen wordt niet ondersteund

# @title:window
source: Select Replacement Mesh File
it_it: Seleziona il file maglia sostitutivo
nl_nl: Selecteer een vervangend model bestand

# @info:status
source: Reloading a group is not supported
it_it: Il ricaricamento di un gruppo non è supportato
nl_nl: Een groep opnieuw inladen wordt niet ondersteund

# @info:status
source: No link to the original file was found
it_it: Nessun collegamento trovato con il file originale
nl_nl: Er is geen link met een origineel bestand

# @info:status
source: Failed to load mesh
it_it: Impossibile caricare la maglia
nl_nl: Het model kont niet worden ingeladen

# @info:status
source: Replacing meshes with a group of meshes is not supported
it_it: La sostituzione di maglie con un gruppo di maglie non è supportato
nl_nl: Een model vervangen door een groep van modellen wordt niet ondersteund

# @title:window
source: Mesh Tools Settings
it_it: Impostazioni strumenti della maglia
nl_nl: Mesh Tools instellingen

# @info:tooltip
source: Check if models are watertight when loading them
it_it: Controlla se i modelli sono "watertight" quando si caricano
nl_nl: Controlleer of modellen waterdicht zijn na het laden

# @option:check
source: Check models on load
it_it: Controlla il modello al caricamento
nl_nl: Controller modellen na het laden

# @info:tooltip
source: Always recalculate model normals when loading them
it_it: Ricalcola sempre le normali del modello quando caricati
nl_nl: Vervang normaal-vectoren van modellen bij het laden

# @option:check
source: Fix normals on load
it_it: Ripara normali al caricamento
nl_nl: Repareer normaal-vectoren automatisch

# @info:tooltip
source: Unit to convert meshes from when the file does not specify a unit (such as STL files). All units will be converted to millimeters.
it_it: Unità da cui convertire le maglie quando il file non la specifica (come per files STL). Tutte le unità saranno convertite in millimetri.
nl_nl: Eenheid waarvan modellen worden geconverteerd die geen eenheid hebben (zoals STL bestanden). Alle eenheden worden geconverteerd naar millimeter.

# @window:text
source: Unit for files that don't specify a unit:
it_it: Unità per i files che non la specificano:
nl_nl: Eenheid voor bestandne die geen eenheid specificeren

# @option:unit
source: Millimeter (default)
it_it: Millimetro (default)
nl_nl: Millimeter (standaard)

# @option:unit
source: Centimeter
it_it: Centrimetro

# @option:unit
source: Meter
it_it: Metro

# @option:unit
source: Inch
it_it: Pollice
nl_nl: Duim

# @option:unit
source: Feet
it_it: Piedi
nl_nl: Voet

# @info:tooltip
source: Place models at a random location on the build plate when loading them
it_it: Posiziona i modelli in posizioni casuali sul piano durante il caricamento
nl_nl: Plaats modellen op een willekeurige plek op het platform na het laden

# @option:check
source: Randomize position on load
it_it: Posizione casuale al caricamento
nl_nl: Willekeurige positie na laden

# @action:button
source: Close
it_it: Chiudi
nl_nl: Sluiten

# @title:window
source: Rename
it_it: Rinomina
nl_nl: Hernoem

# @info
source: Please provide a new name.
it_it: Si prega di fornire un nuovo nome.
nl_nl: Voer een nieuwe naam in

# @action:button
source: Cancel
it_it: Cancella
nl_nl: Annuleer

# @item:inmenu
source: Replace model...
it_it: Sostituisci il modello...
nl_nl: Vervang model...

# @item:inmenu
source: Check mesh
it_it: Controlla la maglia
nl_nl: Controlleer model

# @item:inmenu
source: Analyse mesh
it_it: Analizza la maglia
nl_nl: Analyseer model

# @item:inmenu
source: Mesh Tools
it_it: Strumenti della maglia
